[TfrmMain]
Ini Translator=Ini Translator
Menu=قائمة
More Buttons|Click to see more buttons=المزيد من الأزرار/أنقر لتشاهد المزيد من الأزرار
&File=&ملف
Open Original...=فتح الأصل...
Open original and translation file=فتح الأصل و ملف الترجمة
Save Original=حفظ الأصل
Save current original file=حفظ ملف الأصل الحالي
Save Original As...=حفظ الأصل باسم...
Save current original file with a new filename=حفظ ملف الأصل الحالي بإسم جديد
New Translation=ترجمة جديدة
Create new translation=إنشاء ترجمة جديدة
Open Translation...=فتح الترجمة...
Open existing translation file=فتح ملف ترجمة متوفر
Save Translation=حفظ الترجمة
Save current translation file=حفظ ملف الترجمة الحالي
Save Translation As...=حفظ الترجمة باسم...
Save current translation with a new filename=حفظ ملف الترجمة باسم جديد
Import...=إستيراد...
Import from an external file or files=إستيراد من ملف أو ملفات خارجية
Export...=تصدير...
Export to an external file or files=تصدير إلى ملف أو ملفات خارجية
Preferences...=خيارات...
Display the settings dialog=عرض لائحة الإعدادات
Reopen=إعادة فتح
Clear=مسح
Clear the MRU list=مسح قائمة الملفات الأخيرة
Remove Invalid=إزالة التالفة
Remove invalid entries from the MRU list=إزالة المدخلات التالفة من قائمة الملفات الأخيرة
Exit=خروج
Exit application=الخروج من البرنامج
&Edit=&تحرير
Nothing to undo=لا يوجد ما تتراجع عنه
Undo last action=التراجع عن آخر إجراء
Cut=قص
Cut selected text=قص النص المحدد
Copy=نسخ
Copy selected text=نسخ النص المحدد
Copy from Original=نسخ من الأصل
Copy the value of Original to Translation=نسخ القيمة من الأصل إلى الترجمة
Copy from Name=نسخ من الإسم
Copy the value of Name to Translation=نسخ القيمة من الإسم إلى الترجمة
Paste=لصق
Paste from clipboard=لصق من الحافظة
Find...=بحث...
Search for text=البحث عن نص
Find Next=البحث عن التالي
Continue searching=متابعة البحث
Replace...=إستبدال...
Replace text=إستبدال النص
Toggle Focus=تبديل التركيز
Toggle focus between list and translation=تبديل التركيز بين القائمة و الترجمة
&Actions=إ&جراءات
Spelling...=تدقيق إملائي...
Spell check the translations=تدقيق الترجمة إملائيا
Previous=السابقة
Go to previous item in list=الإنتقال إلى المادة السابقة في القائمة
Next=التالية
Go to next item in list=الإنتقال إلى المادة التالية في القائمة
Prev untranslated=الغير مترجمة السابقة
Go to previous untranslated item=الإنتقال إلى المادة الغير مترجمة السابقة
Next untranslated=الغير مترجمة التالية
Go to next untranslated item=الإنتقال إلى المادة الغير مترجمة التالية
Use this translation everywhere=إستخدام هذا الترجمة بكل مكان
Make all translations consistent=جعل كافة الترجمات متناسقة
Restore original sort=إستعادة الترتيب الأصلي
Toggle Bookmark=تبديل المعنونة
Bookmark 0=المعنونة 0
Toggle Bookmark 0 on/off=تبديل المعنونة 0 فتح/إغلاق
Bookmark 1=المعنونة 1
Toggle Bookmark 1 on/off=تبديل المعنونة 1 فتح/إغلاق
Bookmark 2=المعنونة 2
Toggle Bookmark 2 on/off=تبديل المعنونة 2 فتح/إغلاق
Bookmark 3=المعنونة 3
Toggle Bookmark 3 on/off=تبديل المعنونة 3 فتح/إغلاق
Bookmark 4=المعنونة 4
Toggle Bookmark 4 on/off=تبديل المعنونة 4 فتح/إغلاق
Bookmark 5=المعنونة 5
Toggle Bookmark 5 on/off=تبديل المعنونة 5 فتح/إغلاق
Bookmark 6=المعنونة 6
Toggle Bookmark 6 on/off=تبديل المعنونة 6 فتح/إغلاق
Bookmark 7=المعنونة 7
Toggle Bookmark 7 on/off=تبديل المعنونة 7 فتح/إغلاق
Bookmark 8=المعنونة 8
Toggle Bookmark 8 on/off=تبديل المعنونة 8 فتح/إغلاق
Bookmark 9=المعنونة 9
Toggle Bookmark 9 on/off=تبديل المعنونة 9 فتح/إغلاق
Goto Bookmark=إنتقال إلى المعنونة
Goto Bookmark 0=الإنتقال إلى إشارة 0
Goto Bookmark 1=الإنتقال إلى إشارة 1
Goto Bookmark 2=الإنتقال إلى إشارة 2
Goto Bookmark 3=الإنتقال إلى إشارة 3
Goto Bookmark 4=الإنتقال إلى إشارة 4
Goto Bookmark 5=الإنتقال إلى إشارة 5
Goto Bookmark 6=الإنتقال إلى إشارة 6
Goto Bookmark 7=الإنتقال إلى إشارة 7
Goto Bookmark 8=الإنتقال إلى إشارة 8
Goto Bookmark 9=الإنتقال إلى إشارة 9
Configure Keyboard...=تكوين لوحة المفاتيح...
Display the keyboard configuration window=عرض نافذة تكوين لوحة المفاتيح
&View=&عرض
Next unmatched shortcut=المختصر التالي الغير مطابق
Find next translated item that is missing a shortcut key present in the original=البحث عن المادة المترجمة التالية التي لا يوجد لها مفتاح مختصر في الأصل
Next suspicious translation=الترجمة الغير مؤكدة التالية
Move to next item that is suspected not being translated correctly=الإنتقال إلى المادة التالية التي ربما لم تتم ترجمتها بشكل صحيح
Configure suspicious translations...=تكوين الترجمات المشكوك فيها...
Configure the behavior of Next Suspicious Translation=تكوين سلوك الترجمة المشكوك فيها التالية
Show Quotes=إظهار علامات الإقتباس
Show quotes in texts=إظهار علامات الإقتباس في النص
Show Key Details=إظهار تفاصيل المفتاح
Display the details pane=عرض لائحة التفاصيل
View Comments=عرض التعليقات
Toggle the comments window=تبديل نافذة التعليقات
View Orphaned Items=عرض المواد الزائدة
Display orphans (items in translation that are not in the original)=عرض المواد الزائدة في الترجمة و التي ليست موجودة في الأصل
Tools=أدوات
Full Screen=شاشة كاملة
Toggle full screen mode=تبديل نمط العرض في شاشة كاملة
&Dictionary=قاموس
New Dictionary...=قاموس جديد...
Create new dictionary=إنشاء قاموس جديد
Load Dictionary...=تشغيل قاموس
Load existing dictionary=تشغيل قاموس متوفر
Save Dictionary...=حفظ القاموس...
Save current dictionary to file=حفظ القاموس الحالي إلى ملف
Translate using Dictionary=الترجمة باستخدام قاموس
Translate using the dictionary=الترجمة باستخدام القاموس
Add to Dictionary=إضافة إلى القاموس
Add current item to the dictionary=إضافة المادة الحالية إلى القاموس
Edit Dictionary...=تحرير القاموس...
Edit the currently loaded dictionary=تحرير القاموس المفتوح حاليا
Invert Dictionary=عكس القاموس
Invert the dictionary=عكس القاموس
&Plugins=&وظائف إضافية
T&ools=&أدوات
Customize...=تخصيص...
Display the tools window=عرض نافذة الأدوات
&Help=&تعليمات
Help=تعليمات
Show help file=إظهار ملف التعليمات
About...=حول...
Show about box=إظهار لائحة حول
Themes=السمات
&Translation:=ال&ترجمة:
Ori&ginal:=ال&أصل:
#=#
Dictionary files|*.dct;*.cat|All files|*.*=ملفات قواميس|*.dct;*.cat|كافة الملفات|*.*
Save Dictionary File=حفظ ملف القاموس
Open Dictionary File=فتح ملف قاموس
Select All=تحديد الكل
Select all text=تحديد كامل النص
ASCII Value(s)...=ASCII (قيم(ة...
Show the ASCII values for the selected text=للنص المحدد ASCII إظهار قيم الـ
Dictionary=قاموس
Clear All Translations=مسح كافة الترجمات
Clear the translated text=مسح النص المترجم
Translated=مترجم
Toggle the Translated status of the item=تبديل الحالة المترجمة للمادة
Add Item...=إضافة مادة...
Add new item to original and translation=إضافة مادة جديدة إلى الأصل و الترجمة
Edit Item...=تحرير المادة...
Edit all parts of the current item=تحرير كافة أجزاء المادة الحالية
Delete Item...=حذف المادة...
Delete the current item from both original and translation=حذف المادة الحالية من الأصل و من الترجمة
Find/Replace=بحث و استبدال
Original\r\nTranslation\r\nBoth\r\n=الأصل\r\nالترجمة\r\nكلاهما\r\n
Fi&nd what:=البحث &عن :
Re&place with:=إ&ستبدال مع "
Find &in:=البحث &في :
Text must match the entire line=يجب أن يطابق النص كامل السطر
Match &line=مطابقة ال&سطر
Case of letters (UPPER/lower) must match=يجب أن تطابق الحروف حالة الكابيتل و الإسمول
Match &case=مطابقة ال&حالة
Find next occurence of the text=البحث عن وجود آخر للنص
&Find Next=البحث عن ال&تالي
Close this dialog=إغلاق هذه اللائحة
Close=إغلاق
Search upwards in the list=البحث إلى الأعلى في النص
Search &up=بحث &لأعلى
Select the field(s) to search in=حدد الحقول أو الحقل للبحث فيها
Replace one item/show replace options=إستبدال مادة واحدة/إظهار خيارات الإستبدال
&Replace=إستبدال
Replace all occurences of the text=إستبدال أي وجود لنفس النص
Replace &All=إستبدال الكل
Skip any control characters (non-alphanumeric) when searching=تجاوز كافة الرموز التحكمية (الغير هجائية) أثناء البحث
Ignore control c&haracters=تجاوز الرموز ال&تحكمية
Language files|*.lng|Inno Setup files|*.isl|Ini files|*.ini;*.inf|Text files|*.txt:*.inc;*.bat;*.doc|All supported files|*.lng;*.isl;*.ini;*.inf;*.txt;*.inc;*.bat;*.doc|All files |*.*=ملفات اللغة|*.lng|Inno Setup ملفات|*.isl|Ini ملفات|*.ini;*.inf|ملفات نصية|*.txt:*.inc;*.bat;*.doc|كافة الملفات المعتمدة|*.lng;*.isl;*.ini;*.inf;*.txt;*.inc;*.bat;*.doc|كافة الملفات |*.*
Open Original Language File=فتح ملف اللغة الأصل
ANSI\r\nUTF-8\r\nUnicode\r\n=ANSI\r\nUTF-8\r\nUnicode\r\n
&Encoding:=الترميز:
Open Translated Language File=فتح ملف اللغة المترجم
Save Translated Language File As=حفظ ملف اللغة المترجم باسم...
Save Original Language File As=حفظ ملف اللغة الأصل باسم...
Original=الأصل
Translation=الترجمة
%0:s, version %1:s: Copyright (c) 2003-%2:d by Peter Thörnqvist; all rights reserved\n\nToolbars and menus courtesy of Toolbar2000.\n\tFor more information, see http://www.jrsoftware.org/tb2k.php.\nTheme enabled toolbars and menus courtesy of TBX.\n\tFor more information, see http://g32.org/tbx/index.html.\nExtra themes for TBX courtesy of Roy Magne Klever.\n\tFor more information, see http://www.rmklever.com/delphitbx.\nUnicode enabled add-on package for Toolbar2000 and TBX courtesy of Silverpoint Development\n\tFor more information, see http://club.telepolis.com/silverpointdev/sptbxlib.\nUnicode controls courtesy of Troy Wolbrink's TNT controls.\n\tFor more information, see http://www.tntware.com/delphicontrols/unicode/.\nSpell checker kindly donated by Addictive Software.\n\tFor more info and additional dictionaries, see http://www.addictivesoftware.com\n\nThis program is released subject to the MPL 1.1 license (http://www.mozilla.org/MPL/MPL-1.1.html for details)\nand come with absolutely no warranty of any kind.=%0:s, version %1:s: Copyright (c) 2003-%2:d by Peter Thörnqvist; all rights reserved\n\nToolbars and menus courtesy of Toolbar2000.\n\tFor more information, see http://www.jrsoftware.org/tb2k.php.\nTheme enabled toolbars and menus courtesy of TBX.\n\tFor more information, see http://g32.org/tbx/index.html.\nExtra themes for TBX courtesy of Roy Magne Klever.\n\tFor more information, see http://www.rmklever.com/delphitbx.\nUnicode enabled add-on package for Toolbar2000 and TBX courtesy of Silverpoint Development\n\tFor more information, see http://club.telepolis.com/silverpointdev/sptbxlib.\nUnicode controls courtesy of Troy Wolbrink's TNT controls.\n\tFor more information, see http://www.tntware.com/delphicontrols/unicode/.\nSpell checker kindly donated by Addictive Software.\n\tFor more info and additional dictionaries, see http://www.addictivesoftware.com\n\nThis program is released subject to the MPL 1.1 license (http://www.mozilla.org/MPL/MPL-1.1.html for details)\nand come with absolutely no warranty of any kind.
About %s...=%s حول...
The translation file has been modified, do you want to save it?=تم تعديل ملف الترجمة , هل تريد حفظه ؟
Original (%s)=(%s) الأصل
Translation (%s)=(%s) الترجمة
The text "%s" could not be found=تعذر العثور على النص "%s"
Find=بحث
Modified=معدل
Ready=جاهز
Information=معلومات
Confirm=تأكيد
Error=خطأ
Dictionary is empty: create or load a dictionary first!=القاموس فارغ , قم بإنشاء قاموس أو إفتح أي قاموس أولا
Dictionary created and ready for use.=تم إنشاء القاموس و أصبح جاهزا للإستخدام
Clear current dictionary items first?=مسح مواد القاموس الحالية أولا ؟
Unable to locate the help file (%s). Make sure the file exists and try again.=إبحث عنه ثم حاول ثانية (%s). تعذر إيجاد ملف التعليمات
inverted=معكوس
File "%s" not found: make sure the file exists and try again=غير موجود , تأكد من ذلك و حاول ثانية "%s" الملف
This function is not yet implemented=هذه الوظيفة لم يتم تطبيقها بعد
"%s" has been changed outside the program, do you want to reload it?=قد تم تغييره خارج البرنامج , أترغب بإعادة فتحه؟ "%s"
%d items=مادة %d
Save Translation Template=حفظ قالب الترجمة
The language will not be changed until you restart the program=يجب إعادة تشغيل البرنامج لتفعيل اللغة
Delete selected item?=هل تحذف المادة المحددة ؟
[%0:s] - %1:s=[%0:s] - %1:s
(no dictionary)=(لا يوجد قاموس)
Decoded characters=رموز مفككة الترميز
ASCII Value(s):=ASCII قيمة الـ:
lng=lng
ANSI=ANSI
UTF-8=UTF-8
Unicode=Unicode
All files (*.*)|*.*=كافة الملفات (*.*)|*.*
%0:d of %1:d translated=تمت ترجمة %0:d من %1:d
Copy to Clipboard?=أتنسخ للحافظة ؟
(not assigned)=(غير معين)
Assigned to:=مُعيّن إلى:
(none)=(بدون)
Import=إستيراد
Available &plugins:=ال&وظائف الإضافية المتوفرة :
&Import=&إستيراد
Export=تصدير
&Export=&تصدير
There are no plugins to show.=لا يوجد وظائف الإضافية للعرض
Plugin Error=خطأ بالوظيفة الإضافية
Save modifications to the dictionary?=هل تحفظ التعديل إلى القاموس؟
Arguments:=إجراءات:
Failed to execute "%s %s": %s=%s :" %s %s" فشل التشغيل لـ
(New Tool %d)=(أداة جديدة %d)
Could not create file "%s".\r\nPlease check that the file is writable and that you have sufficient permissions to create and modify files in the affected folder.="%s" تعذر إنشاء الملف\r\nالرجاء تأكد من أن الملف قابل للكتابة و بأنه لديك رخص كافية لإنشاء و لتعديل الملفات في المجلد الهدف
Confirm Delete=تأكيد الحذف
Edit Item=تحرير المادة
Add Item=إضافة مادة
Section cannot be empty=لا يمكن أن يكون القسم فارغا
Name cannot be empty=لا يمكن أن يكون الإسم فارغا
Original text cannot be empty=لا يمكن أن يكون النص الأصلي فارغا
An item with the specified Section and Name already exists=يوجد مسبقا مادة بالقسم و الإسم المحددين
Translating with dictionary finished=أنتهت الترجمة مع القاموس
Select a language file=حدد ملف اللغة
Select a help file=حدد ملف التعليمات
Some items (%d) could not be saved as they had no Original value=بعض المواد (%d) لا يمكن حفظها بما أنه ليس لها قيمة أصلية
Saving the translation now will remove any orphaned items from the file. Continue anyway?=سيزيل الحفظ للترجمة الآن أي مواد متبقية من الملف . هل تستمر على أي حال ؟
%d orphan(s)=%d مادة مخلفات
The current items seems to have been imported. Do you want to export them instead?=يبدو أن المواد الحالية قد تم إستيرادها . هل تريد تصديرها بدلا من ذلك ؟
Undo text=التراجع عن النص
Undo add=التراجع عن الإضافة
Undo edit=التراجع عن التحرير
Undo delete=التراجع عن الحذف
File=ملف
Edit=تحرير
Copy all text from original file to translation=نسخ كامل النص من الأصل إلى ملف الترجمة
View=عرض
Actions=إجراءات
Set focus to the translation edit field=وضع التركيز على حقل التحرير للترجمة
Set focus to the listview=وضع التركيز إلى عرض القائمة
Set focus to the original edit field=وضع التركيز إلى حقل تحرير الأصل
=
Create a new translation template file for IniTranslator itself=نفسه IniTranslator عمل قالب ترجمة جديد لـ
MRU=MRU
Move to the top of the list=تحريك إلى أعلى القائمة
Move to the bottom of the list=تحريك إلى أسفل القائمة
Move one page up in the list=تحريك صفحة واحدة إلى أعلى القائمة
Move one page down in the list=تحريك صفحة واحدة إلى أسفل القائمة
This action is just here to disable shortcuts in rich edits (no need to translate this text)=(هذا الإجراء هو هنا فقط لتعطيل الإختصارات في التعديلات الموسعة (لا حاجة لترجمة هذا النص
Test the exception handler=فحص معالج الإستثناء

[TfrmFindReplace]
Find/Replace=بحث و استبدال

[TfrmComments]
Comments=تعليقات
&Translation:=ال&ترجمة:
&Original:=ا&لأصل :
&Undo=ت&راجع
Undo|Reverts the last action=تراجع|العودة عن الإجراء الأخير
-=-
Cu&t=&قص
Cut|Cuts the selection and puts it on the Clipboard=قص|قص التحديد و وضعه في الحافظة
&Copy=&نسخ
Copy|Copies the selection and puts it on the Clipboard=نسخ|نسخ التحديد و وضعه في الحافظة
&Paste=&لصق
Paste|Inserts Clipboard contents=لصق|تفريغ محتويات الحافظة
Select &All=تحديد الكل
Select All|Selects the entire document=تحديد الكل|تحديد الوثيقة بالكامل

[TfrmOptions]
Preferences=ترجمة الأستاذ عوض الغامدي                     خيارات
OK=حسنا
Cancel=إلغاء الأمر
Select a new font for the list and edit fields=حدّد خط جديد للقائمة وعدل الحقول
Color&s...=الأ&لوان...
General=عام
&Language:=ال&لغة :
&Help:=ال&تعليمات:
&Font:=ال&خط:
Si&ze:=ال&حجم:
Preview:=معاينة:
Enclose strings in quote characters when editing them=إحاطة الدالات برموز الإقتباس عند تعديلها
Show &quotes=إظهار علامات الإقتباس
Show the details panel in the main window=إظهار لوحة التفاصيل في النافذة الرئيسية
Sho&w details=إظهار التفاصيل
Show tooltips windows=إظهار تلميحات النوافذ
Show &tooltips:=إظهار التلميحات:
Show shortcuts in tooltips windows=إظهار الإختصارات في نوافذ التلميحات
Show short&cuts in tooltips=إظهار الإختصارات في التلميحات
Save the current edits when pressing RETURN=RETURN أحفظ التعديل الحالي عند ضغط
Press &RETURN to confirm translation:=لتأكيد الترجمة &RETURN إضغط:
Move to the next item when pressing RETURN (press Shift+RETURN to move to the previous item)=(للإنتقال إلى المادة السابقة Shift+RETURN إضغط) RETURN الإنتقال إلى المادة التالية عند ضغط
A&utomatically move to next/previous=الإنتقال آليا إلى التالي أو السابق
...=...
Click to edit, click again to save.  To restore default preview, clear the text.=أنقر للتحرير ، أنقر ثانية للحفظ . لإستعادة المعاينة الإفتراضية ، أمسح النص
When a translation is made, copies the translation to all other matching items automatically=عندما تتم الترجمة , فإن نسخ منها تتوزع على المواد المطابقة أوتوماتيكيا
Use translation ever&ywhere=إستخدام الترجمة بكل مكان
When activated, typing in the listview will automatically move focus to the translation edit field.=سينتقل التركيز آليا إلى حقل تحرير الترجمة listviewعندما يتم تنشيطه , كتابة الـ
Autofo&cus translation when typing=تركيز آلي للترجمة عند الكتابة
Remember location of main window=تذكر مكان النافذة الرئيسية
Remember form &position:=تذكر من المكان:
Remember whether main window was minimized /maximized=تذكر إذا ما كانت النافذة الرئيسية مصغرة أم مكبرة
Remember form min/ma&x state=تذكر من حالة أقصى أو أدنى
Advanced=خيارات متقدمة
&Encoding for new files:=ال&ترميز للملفات الجديدة:
&Header:=ال&مقدمة:
&Footer:=ال&تذييل :
ANSI\r\nUTF-8\r\nUnicode\r\n=ANSI\r\nUTF-8\r\nUnicode\r\n
When a file is opened, set the new folder as the start folder for all file open and save dialogs=عندما يكون الملف مفتوحا ضع المجلد الجديد كمجلد بداية لكل عملية فتح  أو حفظ ملف
Use sa&me start folder for all files=أستخدم نفس مجلد البدء لكل الملفات
Enable to show the full path and filename of the loaded files in the listview's columns header=تمكين إظهار المسار الكامل و اسم الملف للملفات المفتوحة في مقدمة قوائم نافذة العرض
Sh&ow full filename in list columns=إظهار إسم الملف بالكامل في أعمدة القوائم
Continually check whether the currently loaded files are being modified outside the program=التدقيق بشكل متتابع في ما إذا الملفات المفتوحة قد تم تعديلها خارج البرنامج
Monitor external file &changes=مراقبة تغيرات الملف الخارجي
Switch order of the items in the dictionary=تغيير ترتيب المواد في القاموس
In&vert dictionary=أعكس القاموس
When translating with the dictionary, strip out any &'s in the original text before comparing=عند الترجمة بالقاموس نزع  أي علامة لـ  "&" من النص الأصلي قبل المقارنة
I&gnore &&'s in dictionaries=تجاهل  && في القواميس
Skip already translated items when using dictionary=تجاوز المواد المترجمة مسبقا عند إستعمال القاموس
&Ignore translated items when using dictionary=&تجاهل المواد المترجمة عند إستعمال القاموس

[TfrmOrphans]
Orphaned Items=مواد مهملة
Menu=قائمة
More Buttons|Click to see more buttons=المزيد من الأزرار/أنقر لتشاهد المزيد من الأزرار
&Actions=إ&جراءات
&Save...=&حفظ...
&Merge...=&دمج...
Add to main list=إضافة إلى القائمة الرئيسية
Copy=نسخ
Remove=إزالة
Paste into current item=لصق إلى المادة الحالية
Clear=مسح
Find Item=البحث عن مادة
Find Next=البحث عن التالي
Close=إغلاق

[TfrmConfigKbd]
Configure Keyboard=ضبط لوحة المفاتيح
Cate&gories:=:الفئات
Co&mmands:=:الأوامر
&New shortcut:=:إختصار جديد
&Current shortcuts:=:الإختصارات الحالية
Select command:=:تحديد أمر
Select shortcut:=تحديد إختصار:
Description:=:وصف
&Add=&إضافة
&Remove=إزا&لة
R&eset=إ&ستعادة
&Close=إغلاق

[TfrmImportExport]
Import/Export=إستيراد و تصدير
OK=حسنا
Close=إغلاق
Configure...=تكوين...
(there is nothing to show in this view)=(لا يوجد شيء لمشاهدته في هذا المنظر)

[TfrmTools]
External Tools=الأدوات الخارجية
Me&nu Contents:=محتويات القائمة:
OK=حسنا
Cancel=إلغاء الأمر
Add a new tool item=إضافة مادة أداة جديدة
&Add=&إضافة
Remove selected tool item=إزالة مادة الأداة المحددة
&Delete=حذف
Move item higher in list=تحريك المادة إلى أعلى في القائمة
Move &Up=تحريك لفوق
Move item lower in list=تحريك المادة إلى أسفل في القائمة
Move Do&wn=تحريك لتحت
&Title:=العنوان:
&Command:=الأمر:
A&rguments:=الإجراءات:
&Initial Directory:=المجلد المبدئي:
Shortcut &Key:=مفتاح إختصار:
&...=&...
When executed, a dialog is displayed where you can type in any additional arguments of your choice=عند التنفيذ سيتم عرض لوحة بحيث يمكنك أن تكتب أي تعاملات إضافية من إختيارك
&Prompt for arguments=الحث على الإجراءات
Wait for the command to complete before returning to the program (doesn't work with all programs)=(إنتظر الأمر حتى ينتهي قبل العودة إلى البرنامج (لا يعمل مع كافة البرامج
Wait for co&mpletion=إنتظار الإتمام
Use an alternate method to execute command. If your command doesn't work, try checking this option=إستعمل طريقة بديلة لتنفيذ الأمر . إذا لم يعمل الأمر فجرب تأشير هذا الخيار
Use Shell E&xecute=إستخدام إمتداد القشرة
C&lear=مسح
Execute the command without closing this dialog=تنفيذ الأمر بدون إغلاق لوحة الحوار هذه
&Test=تجربة
All Executables (*.exe;*.com;*.pif;*.bat;*.cmd)|*.exe;*.com;*.pif;*.bat;*.cmd|All files (*.*)|*.*=(*.exe;*.com;*.pif;*.bat;*.cmd) جميع الملفات التنفيذية|*.exe;*.com;*.pif;*.bat;*.cmd|(*.*) كل الملفات|*.*
Original Line=السطر الأصلي
Original Text=النص الأصلي
Original Path=المسار الأصلي
Original Directory=المجلد الأصلي
Original Name=الإسم الأصلي
Original Extension=الإمتداد الأصلي
Translation Line=سطر الترجمة
Translation Text=نص الترجمة
Translation Path=مسار الترجمة
Translation Directory=مجلد الترجمة
Translation Name=إسم الترجمة
Translation Extension=إمتداد الترجمة
Dictionary Path=مسار القاموس
Dictionary Directory=مجلد القاموس
Dictionary Name=إسم القاموس
Dictionary Extension=إمتداد القاموس
Application Directory=مجلد التطبيق
Windows Directory=Windows مجلد
System Directory=System مجلد

[TfrmPromptArgs]
Title=العنوان
Arguments:=إجراءات:
Command Line:=سطر الأمر:
Cancel=إلغاء الأمر
OK=حسنا
Original Line=السطر الأصلي
Original Text=النص الأصلي
Original Path=المسار الأصلي
Original Directory=المجلد الأصلي
Original Name=الإسم الأصلي
Original Extension=الإمتداد الأصلي
Translation Line=سطر الترجمة
Translation Text=نص الترجمة
Translation Path=مسار الترجمة
Translation Directory=مجلد الترجمة
Translation Name=إسم الترجمة
Translation Extension=إمتداد الترجمة
Dictionary Path=مسار القاموس
Dictionary Directory=مجلد القاموس
Dictionary Name=إسم القاموس
Dictionary Extension=إمتداد القاموس
Application Directory=مجلد التطبيق
Windows Directory=Windows مجلد
System Directory=System مجلد

[TfrmEditItem]
Edit Item=تحرير المادة
&Section:=ال&قسم:
&Original:=ا&لأصل :
&Translation:=ال&ترجمة:
&Name:=ال&إسم:
&OK=&حسنا
Cancel=إلغاء الأمر
Ori&ginal Comment=تعليق ال&أصل
T&ranslation Comment=تعليق ال&ترجمة

[TfrmConfigSuspicious]
Configure suspicious translations=تكوين الترجمات المشكوك فيها
&Match between original and translation (one string per row):=(ال&مقارنة بن الأصل و الترجمة (عبارة واحدة لكل صف
Treat as suspicious:=شروط إعتبار الترجمة مشكوك فيها :
&Leading spaces mismatch=عدم التطابق لمسافات المقدمة
&Trailing spaces mismatch=عدم التطابق لمسافات النهاية
Mismatched &control characters at end=رموز تحكم &غير متطابقة في النهاية
&Original and translation are the same=الأصل و الترجمة متشا&بهان
Translation is &empty=الترجمة &فارغة
OK=حسنا
Cancel=إلغاء الأمر

[TfrmDictTranslationSelect]
Select Translation=حدد الترجمة
&Original:=ا&لأصل :
&Translation:=ال&ترجمة:
A&vailable translations:=الرجمات ال&متوفرة :
Use the suggested translation=إستخدام الترجمة المقترجة
&Change=&تغيير
Stop translating=إيقاف الترجمة
Close=إغلاق
Ignore this item (don't translate)=(تجاهل هذه المادة (عدم ترجمتها
&Ignore=ت&جاهل
Add suggested translation to dictionary=إضافة الترجمة المقترحة إلى القاموس
&Add=&إضافة
Skip items that are already translated=تجاوز المواد التي تم ترجمتها مسبقا
&Don't check translated items=&عدم تدقيق المواد المترجمة
Don't show this dialog again and use the latest response=عدم إظهار هذه اللائحة ثانية و استخدام الإستجابة الأخيرة
Don't &ask again (in this session)=(عدم السؤال ثانية (في هذه الجلسة

[TfrmDictEdit]
Edit Dictionary=تحرير القاموس
&Original:=ا&لأصل :
&Translations:=التر&جمات :
S&how:=&عرض :
Add a new original=إضافة أصل جديد
A&dd=إ&ضافة
Remove selected original=إزالة الأصل المحدد
Re&move=إ&زالة
Displays available translations. Bold items are the default translations.=لإظهار الترجمات المتوفرة . المواد بالخط العريض هي الترجمات الإفتراضية
Add a new translation=إضافة ترجمة جديدة
&Add=&إضافة
Remove the selected translation=إزالة الترجمة المحددة
&Remove=إزا&لة
OK=حسنا
Cancel=إلغاء الأمر
Change the selection to see different subsets of the dictionary=تغيير التحديد لمشاهدة المجموعات-الفرعية المختلفة من القاموس
All items\r\nItems with translations\r\nItems without translations\r\nItems with > 1 translations\r\nItems with 1 translation\r\n=كافة المواد\r\nمواد مع ترجمات\r\nمواد بدون ترجمات\r\nمواد مع > 1 ترجمة\r\nمواد مع 1 ترجمة\r\n
Make Default=وضع كإفتراضي

[TfrmColors]
Color Preferences=خيارات اللون
&Untranslated items:=المواد ال&ير مترجمة
&Even rows:=الصفوف ال&زوجية
&Odd rows:=الصفوف ال&فردية:
&Font color:=لون ال&خط :
Fo&nt color:=لون الخ&ط:
Fon&t color:=لو&ن الخط:
Cancel=إلغاء الأمر
OK=حسنا

[SpellChecker]
Check spelling as you type=التدقيق الإملائي أثناء الكتابة
Correct spelling errors as you type=التصحيح الإملائي أثناء الكتابة
Ignore words in &UPPERCASE=تجاهل الكلمات ذات الحروف الكبيرة
Ignore words containing numbers=تجاهل الكلمات المتضمّنة أرقام
Ignore markup languages (&HTML, XML, etc)=(إلخ &HTML و XML) تجاهل لغة الترميز 
Ignore Internet addresses=تجاهل عناوين الإنترنت
Ignore quoted lines=تجاهل السطور المقتبسة
Ignore abbreviations=تجاهل الإختصارات
Suggest from main dictionaries only=أقترح من القواميس الرئيسية فقط
Prompt on repeated word=الحث مع الكلمة المعادة
Automatically correct DUal capitals=تصحيح حروف الكابيتل المكرّرة
Confirmation:=التأكيد:
Delete this custom dictionary?=هل تحذف هذا القاموس المخصص الجديد ؟
(Ignore All / Change All)=(تجاهل الكل / تغيير الكل)
Spelling=تدقيق إملائي
Spelling Options=خيارات التدقيق الإملائي
Dictionaries=قواميس
Words added with Ignore All / Change All=الكلمات المضافة مع تجاهل الكل / تغيير الكل
New Custom Dictionary=قاموس مخصص جديد
Not Found:=غير موجود:
Repeated Word:=الكلمة المكررة:
&Replace With:=إستبدال &مع:
&Suggestions:=&مقترحات:
&Undo=ت&راجع
&Options...=...&خيارات
&Ignore All=تجاهل الك&ل
I&gnore=ت&جاهل
&Change All=تغيير ال&كل
C&hange=ت&غيير
&Add=&إضافة
Au&to-Correct=تصحيح-تلقائي
&Help=&تعليمات
Cancel=إلغاء الأمر
Reset Defaults=إستعادة الإفتراضيات
 O&ptions: = &خيارات:
 D&ictionaries: = ال&قواميس:
Name=الإسم
Filename=إسم الملف
&Custom Dictionary:=قاموس مخصص:
&Dictionaries ...=قواميس...
Locate Dictionaries...=تحديد القواميس...
Choose Folder Containing Dictionaries=إختر المجلد المتضمن القواميس
 Custom Dictionaries: = القواميس المخصصة:
&Edit=&تحرير
&Delete=حذف
&New=جديد
&OK=&حسنا
&Enter the new custom dictionary name:=أدخل الإسم للقاموس المخصص الجديد
Add&ed Words=الكلمات ال&مضافة
These words will be considered correct during a spell check operation.=هذه الكلمات سيتم اعتبارها صحيحة أثناء عملية التدقيق الإملائي
&Ignore this word:=&تجاهل هذه الكلمة
A&uto-Correct Pairs=تصحيح الثنائي تلقائيا
These words will automatically be corrected when encountered during a spelling check.=سيتم تصحيح هذه الكلمات نلقائيا عند مصادفتها أثناء التدقيق الإملائي
&Replace:=&استبدال
&With:=&مع :
&Excluded Words=الكلمات ال&مستبعدة
These words will always be considered incorrect during a spell check operation.=هذه الكلمات سيتم اعتبارها صحيحة أثناء دائما أثناء عملية التدقيق الإملائي
E&xclude this word:=إ&ستبعاد هذه الكلمة:
The spelling check is complete.=تم التدقيق الإملائي
Words checked:=الكلمات المدققة:
The selection has been checked.  Would you like to check the remainder of the document?=تم تدقيق التحديد . هل تريد تدقيق بقية الملف ؟
(no suggestions)=(لا يوجد إقتراحات)
A&uto Correct=ت&صحيح تلقائي
&Spelling ...=ا&لإملاء ...

[DC++]
Import from DC++ language file=DC++ إستيراد من ملف لغة
Export to DC++ language file=DC++ تصدير إلى ملف لغة
DC++ language files (*.xml)|*.xml|All files (*.*)|*.*=DC++ ملفات لغة (*.xml)|*.xml|كافة الملفات (*.*)|*.*

[Foxit]
Foxit Files (*.xml)|*.xml|All files (*.*)|*.*=Foxit ملفات (*.xml)|*.xml|كافة الملفات (*.*)|*.*
Import from Foxit file=Foxit إستيراد من ملف
Export to Foxit file=Foxit تصدير إلى ملف

[TIBFParser]
PHP files (*.php)|*.php|All files (*.*)|*.*=PHP ملفات (*.php)|*.php|كافة الملفات (*.*)|*.*
Export to IB Forums language file=IB Forums تصدير ملف اللغة إلى
Import from IB Forums language file=IB Forums إستيراد ملف اللغة من
There was an error importing, please check the files and try again=كان هناك خطأ بالإستيراد ، الرجاء تأكد من الملفات و حاول ثانية
IB Forums Parser Error=اللغوي IB Forums خطأ بمحلل

[TfrmExport]
Invalid filename "%s". Select another filename and try again.=حدد إسم آخر وحاول ثانية "%s" اسم ملف خطأ
Error=خطأ
File "%s" already exists. Do you want to overwrite it?=موجود مسبقا , هل تريد الكتابة عليه ؟ "%s" الملف
Confirm=تأكيد
Preview=معاينة
&Filename:=إ&سم الملف:
&Preview (editable):=(&معاينة (التحرير ممكن:
...=...
&OK=&حسنا
Cancel=إلغاء الأمر
Save file=حفظ الملف
No more instances of "%s" found="%s" لم يتم العثور على مزيد من
Information=معلومات

[KeePass]
KeePass Language Files (*.lng)|*.lng|All files (*.*)|*.*=KeePass ملفات لغة(*.lng)|*.lng|كافة الملفات (*.*)|*.*
Import from KeePass language file=KeePass إستيراد من ملف لغة
Export to KeePass language file=KeePass تصدير إلى ملف لغة

[TMozillaDTDParser]
Mozilla DTD Files (*.dtd)|*.dtd|All files (*.*)|*.*=Mozilla DTD ملفات (*.dtd)|*.dtd|كافة الملفات (*.*)|*.*
Import from Mozilla DTD file=Mozilla DTD إستيراد من ملف
Export to Mozilla DTD file=Mozilla DTD تصدير إلى ملف

[TMozillaPropsParser]
Mozilla properties files|*.properties|All files (*.*)|*.*=Mozilla ملفات خصائص|*.properties|كافة الملفات (*.*)|*.*
Import from Mozilla Properties file=Mozilla إستيراد من ملف خصائص
Export to Mozilla Properties file=Mozilla تصدير إلى ملف خصائص

[TMsDictParser]
MS Glossary Files (*.csv)|*.csv|All files (*.*)|*.*=MS ملفات قاموس (*.csv)|*.csv|كافة الملفات (*.*)|*.*
Import from MS Glossary CSV file=MS Glossary CSV إستيراد من ملف
Export to MS Glossary CSV file=MS Glossary CSV تصدير إلى ملف
This glossary is intellectual property of Microsoft Corporation. Please refer to the complete copyright text in the README.TXT file included in this file.,,,,,,,=هذا القاموس هو ملكية فكرية من شركة ميكروسوفت . الرجاء الرجوع إلى نص حقوق النشر الكامل في\nالمدرج في هذا الملف README.TXT ملف
Add Microsoft Copyright notice?=؟ Microsoft Copyright هل تضيف ملاحظة
Confirm=تأكيد
Select file=تحديد الملف
&Filename:=إ&سم الملف:
&Skip lines:=ت&جاوز السطور:
...=...
OK=حسنا
Cancel=إلغاء الأمر

[TOlegParser]
OlegTranslator  Files (*.txt)|*.txt|All files (*.*)|*.*=OlegTranslator ملفات (*.txt)|*.txt|كافة الملفات (*.*)|*.*
Import from OlegTranslator file=OlegTranslator إستيراد من ملف
Export to OlegTranslator file=OlegTranslator تصدير إلى ملف

[TfrmSingleImport]
Select file=تحديد الملف
&Filename:=إ&سم الملف:
...=...
OK=حسنا
Cancel=إلغاء الأمر
=

[TGSIParser]
OpenOffice files (*.gsi;*.sdf)|*.gsi;*.sdf|All files (*.*)|*.*=OpenOffice ملفات (*.gsi;*.sdf)|*.gsi;*.sdf|كافة الملفات (*.*)|*.*
Export to OpenOffice language file=OpenOffice إستيراد من ملف
Import from OpenOffice language file=OpenOffice تصدير إلى ملف
There was an error importing, please check the files and try again=كان هناك خطأ بالإستيراد ، الرجاء تأكد من الملفات و حاول ثانية
OpenOffice Parser Error=OpenOffice خطأ تجزئة

[TPHPParser]
PHP files (*.php)|*.php;*.php3|All files (*.*)|*.*=PHP ملفات (*.php)|*.php;*.php3|كافة الملفات (*.*)|*.*
Export to PHP language file=PHP تصدير إلى ملف لغة
Import from PHP language file=OpenOffice GSI إستيراد من ملف لغة
There was an error importing, please check the files and try again=كان هناك خطأ بالإستيراد ، الرجاء تأكد من الملفات و حاول ثانية
PHP Parser Error=اللغوي PHP خطأ بمحلل

[TfrmDualImport]
&Translation file (optional):=(ملف ال&ترجمة (إختياري :
Select files=تحديد الملفات
&Original file:=الملف الأ&صلي :
&Translation file:=ملف ال&ترجمة :
...=...
OK=حسنا
Cancel=إلغاء الأمر
Select Original File=تحديد الملف الأصلي
Select Translation File=تحديد ملف الترجمة

[TPHPNukeParser]
PHP files (*.php)|*.php|All files (*.*)|*.*=PHP ملفات (*.php)|*.php|كافة الملفات (*.*)|*.*
Export to phpNuke language file=phpNuke تصدير إلى ملف لغة
Import from phpNuke language file=phpNuke إستيراد من ملف لغة
phpNuke Parser=اللغوي phpNuke محلل

[POParser]
Import from PO file=PO إستيراد من ملف
Export to PO file=PO تصدير إلى ملف
Configure PO parser=PO تكوين مجزئ
PO files (*.po;*.pot)|*.po;*.pot|All files|*.*=PO ملفات (*.po;*.pot)|*.po;*.pot|كافة الملفات|*.*
PO Export Settings=PO إعدادات تصدير
&Filename:=إ&سم الملف:
&Preview (editable):=(&معاينة (التحرير ممكن:
Compile to &MO:=&MO تجميع إلى:
...=...
OK=حسنا
Cancel=إلغاء الأمر
Command-line to invoke the MO compiler (msgfmt.exe by default).\r\nUse "%i" to insert the filename in "Filename" as the file to compile and use "%o" to change the input file extension to .mo.=(الإفتراضي msgfmt.exe) MO سطر الأمر لإستدعاء أداة تجميع\r\n\ستعمل "%i" لإدخال إسم الملف في لتجميع الملف\n.mo ثم أستعمل "%o" لتغيير إمتداد الملف إلى\n

[PolyGlot]
PolyGlot Translator  Files (*.lng)|*.lng|All files (*.*)|*.*=PolyGlot Translator  ملفات (*.lng)|*.lng|كافة الملفات (*.*)|*.*
Import from PolyGlot Translator file=PolyGlot Translator إستيراد من ملف
Export to PolyGlot Translator file=PolyGlot Translator تصدير إلى ملف

[ResX]
ResX files (*.resx)|*.resx|All files (*.*)|*.*=ResX ملفات (*.resx)|*.resx|كافة الملفات (*.*)|*.*
Import from ResX file=ResX إستيراد من ملف
Export to ResX file=ResX تصدير إلى ملف

[SciTE]
SciTE files (locale.properties)|*.properties|All files (*.*)|*.*=SciTE ملفات (locale.properties)|*.properties|كافة الملفات (*.*)|*.*
Import from SciTE language file=SciTE إستيراد من ملف لغة
Export to SciTE language file=SciTE تصدير إلى ملف لغة
There was an error importing, please check the files and try again=كان هناك خطأ بالإستيراد ، الرجاء تأكد من الملفات و حاول ثانية
SciTE Parser Error=SciTE خطأ بمجزئ

[TMX]
TMX Files (*.tmx)|*.tmx|All files (*.*)|*.*=TMX ملفات (*.tmx)|*.tmx|كافة الملفات (*.*)|*.*
Import from TMX file=TMX إستيراد من ملف
Export to TMX file=TMX تصدير إلى ملف

[Wix]
Import from Wix localization file=Wix localization إستيراد من ملف ترجمة
Export to Wix localization file=Wix localization تصدير إلى ملف ترجمة

[TXilisoftParser]
Lang files (*.lang)|*.lang|All files (*.*)|*.*=Lang ملفات (*.lang)|*.lang|كافة الملفات (*.*)|*.*
Import from Xilisoft lang file=Xilisoft إستيراد من ملف لغة
Export to Xilisoft lang file=Xilisoft تصدير إلى ملف لغة
Please import before export!=الرجاء الإستيراد قبل التصدير
File not found=الملف غير موجود
Configuration=تكوين
Do not export empty translations=عدم تصدير الترجمات الفارغة
OK=حسنا

[XLIFF]
XLIFF files (*.xlf)|*.xlf|All files (*.*)|*.*=XLIFF ملفات (*.xlf)|*.xlf|كافة الملفات (*.*)|*.*
Import from XLIFF file=XLIFF إستيراد من ملف
Export to XLIFF file=XLIFF تصدير إلى ملف

[TToolConsistency]
This plugin checks and displays inconsistent translations=هذه الوظيفة الإضافية تقوم بتدقيق و عرض الترجمات المتناقضة
Check translation consistency...=تدقيق التناقض في الترجمة...
Consistency Checker=مدقق التناقض
&Inconsistent items:=المواد ال&متناقضة:
&Close=إغلاق
Close this form=إغلاق هذا النموذج
&Update=ت&حديث
Update the list=تحديث القائمة
Ignore accelerator &key=تجاهل &مفاتيح التسريع
Synchronize accelerator with &original=مزامنة المسرعات مع ا&لأصل
Automatically insert missing accelerator key when editing.=إدراج تلقائي لمفاتيح التسريع أثناء التحرير
Include/exclude accelerator key when displaying original items=تضمين/إستبعاد مفاتيح التسريع عند عرض المواد الأصلية
Press F2 to edit an item=لتحرير أي مادة F2 أنقر
Use &this translation=إستخدام &هذه الترجمة
Use this translation for all items=إستخدام هذه الترجمة لجميع المواد
Edit=تحرير
Edit current item=تحرير المادة الحالية
Congratulations! - No inconsistent items found!=مبروك - لا يوجد مواد متناقضة

[ToolKeyCheck]
&Check accelerator and access keys...=ت&دقيق مفاتيح التسريع و الوصول...
Key Check plugin for IniTranslator=الإضافية لتدقيق المفاتيح IniTranslator وظيفة 
Accelerator and access key checker=أداة تدقيق مفاتيح التسريع و الوصول
&Ignore items without keys=ت&جاهل المواد التي بدون مفاتيح
&Update=ت&حديث
Edit=تحرير
Close=إغلاق
Show in main list=إظهار في القائمة الرئيسية
Original=الأصل
Translation=الترجمة
Accelerator key=مفتاح التسريع
Access key=مفتاح الوصول
Edit translation=تحرير الترجمة
&Original:=ا&لأصل :
&Translation:=ال&ترجمة:
OK=حسنا
Cancel=إلغاء الأمر

[ToolTrim]
This plugin trims leading and trailing whitespaces and other characters=هذه الوظيفة الإضافية تنظم المسافات الفارغة و بعض الرموز الأخرى من قبل و من بعد السطر
Trim...=تنظيم...
Trim Options=خيارات التنظيم
Trim wh&at:=&مادة التنظيم:
Trim wh&ere:=م&كان التنظيم:
Trim h&ow:=كي&فية التنظيم:
Trim additional &whitespace also=تنظيم المسافات الفارغة أيضا
Original\r\nTranslation\r\nBoth=الأصل\r\nالترجمة\r\nكلاهما
Leading\r\nTrailing\r\nBoth=المبتدئة\r\nالمنتهية\r\nكلاهما
OK=حسنا
Cancel=إلغاء الأمر

[Translator]
Author=Awadh al Ghaamdi
Language=الإفتراضي
EMail=(بدون)
Version=1.9.0.52

